# Найти максимальное из 5 чисел

a = int(input('Введите первое число'))
b = int(input('Введите второе число'))
c = int(input('Введите третье число'))
d = int(input('Введите четвертое число'))
e = int(input('Введите пятое число'))
max_1 = a
if max_1 < b:
    max_1 = b
if max_1 < c:
    max_1 = c
if max_1 < d:
    max_1 = d
if max_1 < e:
    max_1 = e
print (max_1)