# Вывести на экран числа от -N до N

N = int(input())
#number = [range(-N, N)]
#print(number)

for i in range(- N, N + 1):
    print(i)

    